/**
 * ES3 프로퍼티 리스트
 *
 * 이름 - 개요
 * new Array() - 인스턴스 생성
 * Array() - 인스턴스 생성
 *
 * Array 프로퍼티
 * length - 배열의 엘리먼트 수 반환
 *
 * Array.prototype
 * constructor - 생성자
 * unshift() - 배열 처음에 엘리먼트 삽입
 * push() - 배열 끝에 엘리먼트 첨부
 * concat() - 배열 끝에 값을 연결
 * slice() - 인텓스 범위의 엘리먼트를 복사
 * join() - 엘리먼트와 분리자를 결합하여 반환
 * toString() - 엘리먼트를 문자열로 연결하여 반환
 * toLocaleString() - 엘리먼트를 지역화 문자로 변환하고 문자열로 연결하여 반환
 * shift() - 첫 번째 엘리먼트를 삭제하고 삭제한 엘리먼트 반환
 * pop() - 마지막 엘리먼트를 삭제하고 삭제한 엘리먼트 반환
 * splice() - 엘리먼트를 삭제하고 새로운 엘리먼트를 삽입, 삭제한 엘리먼트 반환
 * sort() - 엘리먼트 값을 Unicode 순서로 분류하여 반환
 * reverse() - 엘리먼트 위치를 역순으로 바꾸어 반환
 */