/**
 * 빌트인 오브젝트
 * - Number 오브젝트
 *    - 123과 같은 숫자, 상수, 지수
 * - String 오브젝트
 *    - "abc"와 같은 문자열, 분리, 연결
 * - Boolean 오브젝트
 *    - true, false
 * - Object 오브젝트
 *    - {key: value} 형태
 * - Array 오브젝트
 *    - [1, 2, "A", "가나다"] 형태
 * - Function 오브젝트
 *    - function abc(){} 형태
 * - Math 오브젝트
 *    - abs(), round() 등의 수학 계산
 * - Date 오브젝트
 *    - 연월일, 시분초
 * - JSON 오브젝트
 *    - [{"name": "value"}] 형태
 *    - 서버와 데이터 송수신에 사용
 * - RegExp 오브젝트
 *    - ^, $와 같은 정규 표현식
 *    - 본 강좌에서 다루지 않음
 * - 글로벌 오브젝트
 *    - 소스 파일 전체에서 하나만 존재
 *    - 모든 코드에서 공유, 접근 가능
 *    - 전역 객체라고도 하며, 뉘앙스에 차이 있음
 */